# 🖱️ Прокрутка страницы scrollBy.
#
# 🔹 Задача: с помощью Selenium выполните прокрутку страницы.
#
#     1️⃣ Зайдите на сайт-тренажёр с помощью Selenium.
#     2️⃣ Вычислите высоту страницы.
#     3️⃣ Прокрутите страницу на значение, полученное в шаге 2.
#     4️⃣ Извлеките появившийся пароль. Пароль появится в виде текста в элементе с id="secret-container".
#     5️⃣ Вставьте пароль в поле ниже, между кавычками.
#
# 💡 Совет: обязательно добавьте time.sleep() после прокрутки, так как пароль появляется не сразу.
#
# 🟢На сайте установлена защита от ручного скролинга, пароль появиться только при использовании Selenium.


